

[
  {
    "id" : 0,
    "type": 0,
    "name" : "",
    "company" : "",
    "role" : "",
    "date" : "",
    "links": {
      "demo": "",
      "company": "",
      "store": ""
    },
    "intro" : "",
    "description": "",
    "videos": "",
    "images": ["", "", ""] 
  },
  {
    "id" : 1,
    "type": 1,
    "name" : "Taitiko",
    "company" : " - SuperBytes",
    "role" : "Game Programmer",
    "date" : "from Oct. 2023 to Sep. 2024",
    "links":{
      "demo": "https://www.taitiko.com/",
      "company": "https://www.wearesuperbytes.com/",
      "store": "https://elixir.games/browse/taitiko",
      "code": false
    },
    "intro" : "Welcome to Taitiko, a new era of gaming where fun and games come to life. Play, troll, and compete against other players with our mischievous and wild characters. Do you have what it takes to be the fastest? Hone your skills, earn points, and collect the awesome new Taitikos to show off to other players!",
    "description" : "Hired by the company Superbytes (Barcelona - Spain) in full-time remote work mode, I carried out general programming and video game development tasks related to the creation and implementation of NPC's and state machines (FSM) for Artificial Intelligence behaviors, Machine Learning, HTTP communication with web server and REST API, Networking and online multiplayer systems, cloud hosting services, Gameplay, User Interface, bugs fixing, creation of scenes, game modes, mechanics and prototypes, Implementation of prefabs and asset loading systems, creation of notification and version controller systems, QA and Testing, among others. To develop these tasks I used technologies such as Unity, C#, AI Navigation, Machine Learning Agents, Netcode for GameObjects, Unity Web Request, Unity Cloud Services, Addressables, ProBuilder, Cinemachine, Raycasting and Boxcasting, etc. complemented with development and management tools such as Blender, Postman, Sourcetree, Jira, Bitbucket, GitLab, Scrum, among others.",
    "videos": "https://www.youtube.com/embed/qRfM_FgDWQ0?si=zf9544Cqdd7haSDA",
    "images": ["tk1", "tk2", "tk3", "tk4", "tk5", "tk6", "tk7", "tk8", "tk9", "tk10", "tk11", "tk12", "tk13"] 
  },
  {
    "id" : 2,
    "type": 1,
    "name" : "Apoceus",
    "company" : " - Landell Games",
    "role" : "Game Programmer",
    "date" : "from Jul. 2023 to Nov. 2023",
    "links":{
      "demo": "https://apoceus.com/",
      "company": "https://www.landellgames.com/",
      "store": "https://store.steampowered.com/app/1841690/Apoceus_Winter_Wars/",
      "code": false
    },
    "intro" : "A real-time strategy game that features big maps for large battles, offering depth and strategy. Come in and take the role of different generals, each with their own tactics and large armies. As a player, you're not just leading vast armies, you're in command of war machines and huge monsters.",
    "description" : "Hired by Landell Games studio (Linköping - Sweden) on a remote part-time basis, I performed general video game programming tasks related to bug fixing, performance and optimization, gameplay, artificial intelligence, UI, prefabs implementation, documentation, QA and testing, among others. To carry out these tasks I used technologies such as Unity, C#, AI Navigation, TextMesh Pro, Cinemachine, Unity Terrain Tools, and ProBuilder, complemented with management and development tools such as Plastic SCM, Photon, Fmod, Linear, Figma, and Scrum methodology.",
    "videos": "https://www.youtube.com/embed/rFADxjYHDF0?si=6eLovQgeZH3f0ad-",
    "images": ["ap1", "ap2", "ap3", "ap4", "ap5", "ap6", "ap7", "ap8", "ap9", "ap10", "ap11", "ap12", "ap13"] 
  },
  {
    "id": 3,
    "type": 1,
    "name": "Zombie Shooter",
    "company": " - Personal Project",
    "role": "Game Developer",
    "date": "Published in 2023",
    "links":{
      "demo": "https://tomasfv.itch.io/zombie-shooter",
      "company": false,
      "store": false,
      "code": "https://github.com/tomasfv/Zombie-Shooter-Github"
    },
    "intro": "Find the key, open the door, escape, survive . . .  ",
    "description": "Top-down shoot 'em up focused on finding the way out of a building while the player dodges and shoots the zombies trying to kill him. For this project developed in Unity, I made use of programming techniques such as Object Pooling, implementation of animations, UI, video effects, sound and music, health systems, objects spawning, gameplay, and artificial intelligence among other features. On the other hand, I carried out video game design tasks such as level design, mechanics, gameplay, game rules, progression curve, challenges, difficulty balance, metrics, scoring, etc. The images were generated with Craiyon AI, the music was selected from Pixabay and the graphic assets from OpenGameArt.",
    "videos": "https://player.vimeo.com/video/1003637798?badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479",
    "images": ["zs1", "zs2", "zs3", "zs4", "zs5", "zs6", "zs7", "zs8", "zs9", "zs10", "zs11", "zs12"]
  },
  {
    "id" : 4,
    "type": 1,
    "name" : "Survival Nightmare",
    "company" : " - Personal Project",
    "role" : "Game Developer",
    "date" : "Published in 2023",
    "links":{
      "demo": "https://tomasfv.itch.io/survival-shooter",
      "company": false,
      "store": false,
      "code": "https://github.com/tomasfv/Survival-Shooter"
    },
    "intro" : "",
    "description": "Action TPS developed in Unity and C# focused on surviving a nightmare in which the player must eliminate all the possessed toys that try to kill him. The Zombie Toys asset package offered by Unity was used to create this game. For programming I made use of resources such as Character Controller, AI Navigation, Raycast, and particles system, as well as UI programming, animations, health system, spawn system, SFX implementation and music. ",
    "videos": "https://player.vimeo.com/video/1003691294?badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479",
    "images": ["sn1", "sn2", "sn3", "sn4", "sn5", "sn6", "sn7", "sn8", "sn9"] 
  },
  {
   "id" : 5,
   "type": 1,
    "name" : "Doozy's World",
    "company" : " - Personal Project",
    "role" : "Game Developer",
    "date" : "Published in 2023",
    "links":{
      "demo": "https://tomasfv.itch.io/doozys-world",
      "company": false,
      "store": false,
      "code": false
    },
    "intro" : "",
    "description": "Third-person adventure video game prototype, in which I carried out programming and development tasks related to Unity Terrain Tools, waypoints, player controller, Animation Trees, Cinemachine, Wind Zones, performance, optimization, UI, and Inventory, among others. The assets were selected from Mixamo and Unity Assets Store.",
    "videos": "https://player.vimeo.com/video/1003709266?badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479",
    "images": ["dw1", "dw2", "dw3", "dw4", "dw5", "dw6", "dw7", "dw8"]  
  },
  {
    "id" : 6,
    "type": 1,
    "name" : "Rift Zone: Contact",
    "company" : " - Boosted Reality",
    "role" : "Game programmer",
    "date" : "from Nov. 2024 to Jun. 2025",
    "links":{
      "demo": "https://boostedreality.games/",
      "company": "https://www.odaclick.com/",
      "store": "https://boostedreality.games/products/rift-zone-contact",
      "code": false
    },
    "intro" : "Tabletop battles like you have never seen before. Rift Zone: Contact captures the struggle between the Scry'Ox collective and the UEDF as they battle for control of the far off world of Proxima Centauri B.",
    "description": "Hired by Odaclick Game Studio (Córdoba - Argentina) in full-time hybrid work mode, I carried out general programming and video game tasks related to development and implementation of core game systems, including login for Android and iOS, NFC security, localization, Audio system, game modes, HTTP communication with a web server and REST API, cloud hosting services, gameplay mechanics, user interface, and QA/testing, among others. To develop these tasks I used technologies such as Unity, C#, UnityWebRequest, Unity Cloud Services, Authentication, Unity Localization, and complemented development with tools like GitHub, Postman, and Scrum.",
    "videos": "https://www.youtube.com/embed/3whSbV0Bbuc?si=l5pP_CxNAHBmbqhL",
    "images": ["rzc1"] 
  },
  {
    "id" : 7,
    "type": 2,
    "name" : "Getback",
    "company" : "",
    "role" : "Full Stack Web Developer",
    "date" : "from Mar. 2023 to Nov. 2023",
    "links":{
      "demo": false,
      "company": "https://www.instagram.com/getback.tech/",
      "store": false,
      "code": false
    },
    "intro" : "",
    "description": "Hired by Getback (Santiago, Chile) in a full-time remote position, I worked on reverse logistics software that includes an embedded button directing users to a multi-step form for processing product returns or exchanges, as well as an admin panel for businesses to manage returns, exchanges, inventory, and customer interactions. In this role, I handled full-stack web development, focusing on the creation and maintenance of web applications using JavaScript, TypeScript, React, Redux, Node.js, PostgreSQL, Sequelize, HTML, CSS, Express, Vtex, Bitbucket, Scrum, WordPress, and WooCommerce, among other technologies. Additionally, I contributed to website testing and provided Quality Assurance support to ensure system reliability and efficiency.",
    "videos": "",
    "images": ["gb1", "gb2", "gb3", "gb4", "gb5", "gb6", "gb7", "gb8", "gb9", "gb10", "gb11", "gb12", "gb13", "gb14", "gb15", "gb16", "gb17", "gb18", "gb19", "gb20",
               "gb21", "gb22", "gb23", "gb24", "gb25", "gb26", "gb27", "gb28", "gb29", "gb30", "gb31", "gb32", "gb33", "gb34", "gb35", "gb36", "gb37", "gb38", "gb39", "gb40" ] 
  },
  {
    "id" : 8,
    "type": 2,
    "name" : "Points App",
    "company" : " - Farmacia Alto Palermo",
    "role" : "Full Stack Web Developer",
    "date" : "Published in 2024",
    "links":{
      "demo": "https://demofarmacia.netlify.app/",
      "company": "https://www.instagram.com/farmacia.altopalermo",
      "store": false,
      "code": false
    },
    "intro" : "",
    "description": "Hired by Farmacia Alto Palermo (Córdoba, Argentina) in a freelance position, I developed a full-stack web application consisting of an admin panel that enables the creation, storage, and editing of customers and healthcare plans. The platform also includes features for accumulating and redeeming points based on customer purchases, as well as a secure user login system. In this role, I handled the complete development and maintenance of the software using JavaScript, React, Redux, Node.js, PostgreSQL, Sequelize, HTML, CSS, Express, GitHub, and Reactstrap, among other technologies. Please feel free to visit the demo version of this web app and explore its functionalities.",
    "videos": "",
    "images": ["fap1", "fap2", "fap3", "fap4"] 
  },
  {
    "id" : 9,
    "type": 1,
    "name" : "Kustoms Sports",
    "company" : " - Academic Team Project",
    "role" : "Frontend Developer",
    "date" : "from Sep. 2022 to Oct. 2022",
    "links":{
      "demo": false,
      "company": false,
      "store": false,
      "code": "https://github.com/tomasfv/kustoms-sports"
    },
    "intro" : "",
    "description": "Team Project for the Full Stack Web Development Botcamp at soyHenry academy. Creation of fictitious e-commerce with the following Tech Objectives: Deploy the app, User Authentication System, Payment Gateway and complete purchase process, Combined Filters, Implementation of Cloudinary for managing images, Notifications to users by e-mail, Logical Deletion of products and bans, Data Persistence, Reviews and Scoring System, Administrator Dashboard. We implement the use of React, Redux and Tailwind technologies for the Frontend; Node, Express for the Backend and PostgreSQL with Sequelize for the Database. In addition to libraries such as Stripe, Auth0, Sweetalert, Cloudinary, Nodemailer, among others. ",
    "videos": "https://www.youtube.com/embed/bM7t9NczBkY?si=G68xHHTmT17uf10D",
    "images": ["ks1", "ks2", "ks3", "ks4", "ks5", "ks6", "ks7", "ks8", "ks9", "ks10"] 
  },
  {
    "id" : 10,
    "type": 2,
    "name" : "Travel Website",
    "company" : " - Personal Project",
    "role" : "Frontend Developer",
    "date" : "Published in 2022",
    "links":{
      "demo": "https://travel-website-tomasfv.vercel.app/",
      "company": false,
      "store": false,
      "code": "https://github.com/tomasfv/TravelWebsite"
    },
    "intro" : "",
    "description": "Personal frontend project featuring a travel agency landing page with a classic structure tailored for this type of business. Developed using React, JavaScript, HTML, and CSS, it showcases a clean and engaging design, highlighting essential components such as a navigation bar, destination cards, a video hero section, and additional information in the footer.",
    "videos": "",
    "images": ["tw1", "tw2"] 
  },
  {
    "id" : 11,
    "type": 2,
    "name" : "Universo Tickets Desktop App",
    "company" : " - Odaclick/Exomindset",
    "role" : "Frontend Developer",
    "date" : "From Jun.2025 to Dec.2025",
    "links":{
      "demo": false,
      "company": "https://exomindset.co/es/",
      "store": "https://universotickets.com/",
      "code": false
    },
    "intro" : "",
    "description": "Hired by Odaclick and Exomindset (Córdoba, Argentina) in a full-time remote position, I developed a Desktop App for physical tickets selling. Some of the tasks acomplished in this role were the implementation of UI designs in the app, development of features, components, and screens for direct ticket sales, including the login system, admin panel, search bars, cards, tickets, filters, tables, sales, delivery, and return screens, among others; Use of technologies such as Electron JS, TypeScript, React JS, Material UI, Redux, HTML, and CSS.",
    "videos": "",
    "images": ["uj1", "uj2", "uj3", "uj4", "uj5", "uj6", "uj7", "uj8", "uj9", "uj10", "uj11", "uj12", "uj13", "uj14", "uj15", "uj16", "uj17", "uj18", "uj19", "uj20", "uj21", "uj22", "uj23", "uj24", "uj25"] 
  },
  {
    "id" : 12,
    "type": 2,
    "name" : "Microlab",
    "company" : " - Personal Project",
    "role" : "Frontend Developer",
    "date" : "Published in 2025",
    "links":{
      "demo": "https://app-microlab.netlify.app/",
      "company": false,
      "store": false,
      "code": "https://github.com/tomasfv/microlab"
    },
    "intro" : "",
    "description": "This project is a curated collection of small interactive frontend components, originally developed using HTML, CSS, and JavaScript, and later transformed into React components for seamless integration. Designed as a personal frontend showcase, it highlights micro-interactions and UI elements, demonstrating their functionality in an interactive and engaging manner.",
    "videos": "",
    "images": ["ml1", "ml2", "ml3", "ml4", "ml5", "ml6", "ml7", "ml8"] 
  }
]